CommunityGD32Cores/gigadevice-firmware-and-docs/GD32F20x/GD32F20x_Firmware_Library_V2.0.0/Examples/SPI/I2S_master_transmit_slave_receive_dma/main.c
/*!
    \file  main.c
    \brief I2S master send and slave receive communication use DMA 
*/

/*
    Copyright (C) 2017 GigaDevice

    2015-07-15, V1.0.0, firmware for GD32F20x
    2017-06-05, V2.0.0, firmware for GD32F20x
*/

#include "gd32f20x.h"
#include "gd32f207i_eval.h"

#define ARRAYSIZE          10

uint16_t i2s1_send_array[ARRAYSIZE] = {0xAAB1, 0xAAB2, 0xAAB3, 0xAAB4, 0xAAB5, 0xAAB6, 0xAAB7, 0xAAB8, 0xAAB9, 0xAABA};
uint16_t i2s2_receive_array[ARRAYSIZE]; 
ErrStatus memory_compare(uint16_t* src, uint16_t* dst, uint8_t length);
uint32_t send_n = 0, receive_n = 0;
ErrStatus hxtal_stabilization;

void rcu_config(void);
void gpio_config(void);
void dma_config(void);
void spi_config(void);

/*!
    \brief      main function
    \param[in]  none
    \param[out] none
    \retval     none
*/
int main(void)
{
    /* init led1 */
    gd_eval_led_init(LED1);

    /* peripheral clock enable */
    rcu_config();
    /* GPIO config */
    gpio_config();
    /* DMA config */
    dma_config();
    /* SPI config */
    spi_config();
    /* SPI DMA enable */
    spi_dma_enable(SPI2, SPI_DMA_RECEIVE);
    spi_dma_enable(SPI1, SPI_DMA_TRANSMIT);
    /* DMA channel enable */
    dma_channel_enable(DMA1,DMA_CH0);
    dma_channel_enable(DMA0,DMA_CH4);
    /* SPI enable */
    i2s_enable(SPI2);
    i2s_enable(SPI1);

    /* wait DMA transmit complete */
    while(!dma_flag_get(DMA0, DMA_CH4, DMA_FLAG_FTF));
    while(!dma_flag_get(DMA1, DMA_CH0, DMA_FLAG_FTF));

    /* compare receive data with send data */
    if(memory_compare(i2s2_receive_array, i2s1_send_array, ARRAYSIZE)){
        gd_eval_led_on(LED1);
    }else{
        gd_eval_led_off(LED1);
    }

    while(1);
}

/*!
    \brief      configure different peripheral clocks
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_config(void)
{
    /* deinitialize the RCU */
    rcu_deinit();
    
    /* turn on the oscillator HXTAL */
    rcu_osci_on(RCU_HXTAL);
    hxtal_stabilization = rcu_osci_stab_wait(RCU_HXTAL);
    if(SUCCESS == hxtal_stabilization){
        /* AHB = SYSCLK */
        rcu_ahb_clock_config(RCU_AHB_CKSYS_DIV1);
        /* APB1 = AHB/2 */
        rcu_apb1_clock_config(RCU_APB1_CKAHB_DIV2);
        /* APB2 = AHB/1 */
        rcu_apb2_clock_config(RCU_APB2_CKAHB_DIV1);
        /* CK_PLL1 = 25M */
        rcu_predv1_config(RCU_PREDV1_DIV8);
        rcu_pll1_config(RCU_PLL1_MUL8);
        /* turn on the oscillator PLL1 */
        rcu_osci_on(RCU_PLL1_CK);
        while( ERROR == rcu_osci_stab_wait(RCU_PLL1_CK));
        /* CK_PLL = 25M *3 = 75M*/
        rcu_predv0_config(RCU_PREDV0SRC_CKPLL1,RCU_PREDV0_DIV1);
        rcu_pll_config(RCU_PLLSRC_HXTAL,RCU_PLL_MUL3);
        /* CK_PLL2 = 25/8*14 M= 43.75M*/
        rcu_pll2_config(RCU_PLL2_MUL14);
        /* turn on the oscillator PLL1 */
        rcu_osci_on(RCU_PLL2_CK);
        while( ERROR == rcu_osci_stab_wait(RCU_PLL2_CK));
        /* configure the I2S1/I2S2 clock source selection */
        rcu_i2s1_clock_config(RCU_I2S1SRC_CKPLL2_MUL2);
        rcu_i2s2_clock_config(RCU_I2S2SRC_CKPLL2_MUL2);
    }
    /* enable PLL */
    rcu_osci_on(RCU_PLL_CK);
    /* wait till PLL is ready */
    while( ERROR == rcu_osci_stab_wait(RCU_PLL_CK));
    /* select PLL as system clock source */
    rcu_system_clock_source_config(RCU_CKSYSSRC_PLL);
    /* wait till PLL is used as system clock source */
    while(RCU_SCSS_PLL != rcu_system_clock_source_get());

    rcu_periph_clock_enable(RCU_SPI1);
    rcu_periph_clock_enable(RCU_SPI2);
    rcu_periph_clock_enable(RCU_GPIOA);
    rcu_periph_clock_enable(RCU_GPIOB);
    rcu_periph_clock_enable(RCU_GPIOC);
    rcu_periph_clock_enable(RCU_AF);
    rcu_periph_clock_enable(RCU_DMA0);
    rcu_periph_clock_enable(RCU_DMA1);
}

/*!
    \brief      configure the GPIO peripheral
    \param[in]  none
    \param[out] none
    \retval     none
*/
void gpio_config(void)
{
    /* I2S1 GPIO config: I2S1_WS/PB12, I2S1_CK/PB13, I2S_SD/PB15 */
    gpio_init(GPIOB, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_12 | GPIO_PIN_13 |GPIO_PIN_15);

    /* I2S2 GPIO config: I2S2_WS/PA4, I2S2_CK/PC10, I2S2_SD/PC12 */
    gpio_pin_remap_config(GPIO_SPI2_REMAP, ENABLE);
    gpio_init(GPIOC, GPIO_MODE_IN_FLOATING, GPIO_OSPEED_50MHZ, GPIO_PIN_10 | GPIO_PIN_12);
    gpio_init(GPIOA, GPIO_MODE_IN_FLOATING, GPIO_OSPEED_50MHZ, GPIO_PIN_4);
}

/*!
    \brief      configure the DMA peripheral
    \param[in]  none
    \param[out] none
    \retval     none
*/
void dma_config(void)
{
    dma_parameter_struct dma_init_struct;
    
    /* SPI1 transmit dma config: DMA0,DMA_CH4  */
    dma_deinit(DMA0, DMA_CH4);
    dma_init_struct.periph_addr  = (uint32_t)&SPI_DATA(SPI1);
    dma_init_struct.memory_addr  = (uint32_t)i2s1_send_array;
    dma_init_struct.direction    = DMA_MEMORY_TO_PERIPHERAL;
    dma_init_struct.memory_width = DMA_MEMORY_WIDTH_16BIT;
    dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_16BIT;
    dma_init_struct.priority     = DMA_PRIORITY_LOW;
    dma_init_struct.number       = ARRAYSIZE;
    dma_init_struct.periph_inc   = DMA_PERIPH_INCREASE_DISABLE;
    dma_init_struct.memory_inc   = DMA_MEMORY_INCREASE_ENABLE;
    dma_init(DMA0, DMA_CH4, dma_init_struct);
    /* configure DMA mode */
    dma_circulation_disable(DMA0, DMA_CH4);
    dma_memory_to_memory_disable(DMA0, DMA_CH4);

    /* SPI2 receive dma config: DMA1-DMA_CH0 */
    dma_deinit(DMA1, DMA_CH0);
    dma_init_struct.periph_addr  = (uint32_t)&SPI_DATA(SPI2);
    dma_init_struct.memory_addr  = (uint32_t)i2s2_receive_array;
    dma_init_struct.direction    = DMA_PERIPHERAL_TO_MEMORY;
    dma_init_struct.priority     = DMA_PRIORITY_HIGH;
    dma_init(DMA1, DMA_CH0, dma_init_struct);
    /* configure DMA mode */
    dma_circulation_disable(DMA1, DMA_CH0);
    dma_memory_to_memory_disable(DMA1, DMA_CH0);
}

/*!
    \brief      configure the SPI peripheral
    \param[in]  none
    \param[out] none
    \retval     none
*/
void spi_config(void)
{
    spi_i2s_deinit(SPI1);
    spi_i2s_deinit(SPI2);

    i2s_init(SPI1, I2S_MODE_MASTERTX, I2S_STD_PHILLIPS, I2S_CKPL_LOW);
    i2s_psc_config(SPI1, I2S_AUDIOSAMPLE_44K, I2S_FRAMEFORMAT_DT16B_CH16B, I2S_MCKOUT_DISABLE);
    
    i2s_init(SPI2, I2S_MODE_SLAVERX, I2S_STD_PHILLIPS, I2S_CKPL_LOW);
    i2s_psc_config(SPI2, I2S_AUDIOSAMPLE_44K, I2S_FRAMEFORMAT_DT16B_CH16B, I2S_MCKOUT_DISABLE);
}

/*!
    \brief      memory compare function
    \param[in]  src: source data pointer
    \param[in]  dst: destination data pointer
    \param[in]  length: the compare data length
    \param[out] none
    \retval     ErrStatus : ERROR or SUCCESS
*/
ErrStatus memory_compare(uint16_t* src, uint16_t* dst, uint8_t length) 
{
    while (length--){
        if (*src++ != *dst++)
            return ERROR;
    }
    return SUCCESS;
}
